server/templates/v_10/suministroOperacionesTrascendenciaTributaria/consultaLROperacionesSeguros.hbs

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:con="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/ssii/fact/ws/ConsultaLR.xsd"
 xmlns:sum="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/ssii/fact/ws/SuministroInformacion.xsd">
	<soapenv:Header/>
	<soapenv:Body>
		<con:ConsultaLROperacionesSeguros>
			<sum:Cabecera>
				<sum:IDVersionSii>{{ cabecera.idVersion }}</sum:IDVersionSii>
				<sum:Titular>
					<sum:NombreRazon>{{ cabecera.titular.nombreRazon }}</sum:NombreRazon>
					<sum:NIF>{{ cabecera.titular.nif }}</sum:NIF>
				</sum:Titular>
			</sum:Cabecera>
			<con:FiltroConsulta>
				<sum:PeriodoImpositivo>
					<sum:Ejercicio>{{ filtroConsulta.periodoImpositivo.ejercicio }}</sum:Ejercicio>
					<sum:Periodo>{{ filtroConsulta.periodoImpositivo.periodo }}</sum:Periodo>
				</sum:PeriodoImpositivo>
				{{#if filtroConsulta.contraparte}}
				<!--Optional:-->
				<con:Contraparte>
					<sum:NombreRazon>{{ filtroConsulta.contraparte.nombreRazon }}</sum:NombreRazon>
					<!--You have a CHOICE of the next 2 items at this level-->
					{{#if filtroConsulta.contraparte.nif}}
					<sum:NIF>{{ filtroConsulta.contraparte.nif }}</sum:NIF>
					{{/if}}{{#ifNot}}
					<sum:IDOtro>
						{{#if filtroConsulta.contraparte.idOtro.codigoPais}}
						<!--Optional:-->
						<sum:CodigoPais>{{ filtroConsulta.contraparte.idOtro.codigoPais }}</sum:CodigoPais>
						{{/if}}
						<sum:IDType>{{ filtroConsulta.contraparte.idOtro.idType }}</sum:IDType>
						<sum:ID>{{ filtroConsulta.contraparte.idOtro.id }}</sum:ID>
					</sum:IDOtro>
					{{/ifNot}}
				</con:Contraparte>
				{{/if}}{{#if filtroConsulta.fechaPresentacion}}
				<!--Optional:-->
				<con:FechaPresentacion>
					{{#if filtroConsulta.fechaPresentacion.desde}}
					<!--Optional:-->
					<sum:Desde>{{ filtroConsulta.fechaPresentacion.desde }}</sum:Desde>
					{{/if}}{{#if filtroConsulta.fechaPresentacion.hasta}}
					<!--Optional:-->
					<sum:Hasta>{{ filtroConsulta.fechaPresentacion.hasta }}</sum:Hasta>
					{{/if}}
				</con:FechaPresentacion>
				{{/if}}{{#if filtroConsulta.cobroModificado}}
				<!--Optional:-->
				<con:CobroModificado>{{ filtroConsulta.cobroModificado }}</con:CobroModificado>
				{{/if}}{{#if filtroConsulta.clavePaginacion}}
				<!--Optional:-->
				<con:ClavePaginacion>
					<con:Contraparte>
						<sum:NombreRazon>{{ filtroConsulta.clavePaginacion.contraparte.nombreRazon }}</sum:NombreRazon>
						{{#if filtroConsulta.clavePaginacion.contraparte.nifRepresentante}}
						<!--Optional:-->
						<sum:NIFRepresentante>{{ filtroConsulta.clavePaginacion.contraparte.nifRepresentante }}</sum:NIFRepresentante>
						{{/if}}
						<!--You have a CHOICE of the next 2 items at this level-->
						{{#if filtroConsulta.clavePaginacion.contraparte.nif}}
						<sum:NIF>{{ filtroConsulta.clavePaginacion.contraparte.nif }}</sum:NIF>
						{{/if}}{{#ifNot filtroConsulta.clavePaginacion.contraparte.nif}}
						<sum:IDOtro>
							{{#if filtroConsulta.clavePaginacion.contraparte.idOtro.codigoPais}}
							<!--Optional:-->
							<sum:CodigoPais>{{ filtroConsulta.clavePaginacion.contraparte.idOtro.codigoPais }}</sum:CodigoPais>
							{{/if}}
							<sum:IDType>{{ filtroConsulta.clavePaginacion.contraparte.idOtro.idType }}</sum:IDType>
							<sum:ID>{{ filtroConsulta.clavePaginacion.contraparte.idOtro.id }}</sum:ID>
						</sum:IDOtro>
						{{/ifNot}}
					</con:Contraparte>
				</con:ClavePaginacion>
				{{/if}}
			</con:FiltroConsulta>
		</con:ConsultaLROperacionesSeguros>
	</soapenv:Body>
</soapenv:Envelope>